tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
    /* Start the RTOS scheduler. */
    vTaskStartScheduler();

    /* Infinite loop */
    for(;;)
    {
        
    }
}
/*-----------------------------------------------------------*/

static void prvCliTask( void *pvParameters )
{
    uint32_t ulResponseLength;
    BaseType_t xCount, xResponseRemaining, xResponseSent;
    Socket_t xCLIServerSocket = FREERTOS_INVALID_SOCKET;
    struct freertos_sockaddr xSourceAddress, xServerAddress;
    socklen_t xSourceAddressLength = sizeof( xSourceAddress );
    TickType_t xCLIServerRecvTimeout = portMAX_DELAY;
    char * pcOutputBuffer = FreeRTOS_CLIGetOutputBuffer();

    ( void ) pvParameters;

    xCLIServerSocket = FreeRTOS_socket( FREERTOS_AF_INET,
                                        FREERTOS_SOCK_DGRAM,
                                        FREERTOS_IPPROTO_UDP );
    configASSERT( xCLIServerSocket != FREERTOS_INVALID_SOCKET );

    /* No need to return from FreeRTOS_recvfrom until a message
     * is received. */
    FreeRTOS_setsockopt( xCLIServerSocket,
                         0,
                         FREERTOS_SO_RCVTIMEO,
                         &( xCLIServerRecvTimeout ),
                         sizeof( TickType_t ) );

    xServerAddress.sin_port = FreeRTOS_htons( configCLI_SERVER_PORT );
    xServerAddress.sin_addr = FreeRTOS_GetIPAddress();
    FreeRTOS_bind( xCLIServerSocket, &( xServerAddress ), sizeof( xServerAddress ) );

    configPRINTF( ( "Waiting for requests...\n" ) );

    for( ;; )
    {
        uint8_t ucRequestId[ 4 ];

#if USE_ZERO_COPY

            uint8_t *pucReceivedUDPPayload = NULL;
            xCount = FreeRTOS_recvfrom( xCLIServerSocket,
                                        &pucReceivedUDPPayload,
                                        0,
										FREERTOS_ZERO_COPY,
                                        &( xSourceAddress ),
                                        &( xSourceAddressLength ) );

            configASSERT( (pucReceivedUDPPayload != NULL) && (xCount < configMAX_COMMAND_INPUT_SIZE));

            memcpy(( void * )( &( cInputCommandString[ 0 ] ) ), pucReceivedUDPPayload, xCount);

            FreeRTOS_ReleaseUDPPayloadBuffer( ( void * ) pucReceivedUDPPayload );

#else

            xCount = FreeRTOS_recvfrom( xCLIServerSocket,
                                        ( void * )( &( cInputCommandString[ 0 ] ) ),
                                        configMAX_COMMAND_INPUT_SIZE,
                                        0,
                                        &( xSourceAddress ),
                                        &( xSourceAddressLength ) );

#endif /* USE_ZERO_COPY */

        /* Since we set the receive timeout to portMAX_DELAY, the
         * above call should only return when a command is received. */
        configASSERT( xCount > 0 );
        cInputCommandString[ xCount ] = '\0';

        if( prvIsValidRequest( ( const uint8_t * ) &( cInputCommandString[ 0 ] ), xCount, &( ucRequestId[ 0 ] ) ) == pdTRUE )
        {
            uint8_t ucPacketNumber = 1;
#ifdef TIM7_TEST
            extern uint32_t tim7_period;
            configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_addr,
                                                                             xSourceAddress.sin_port,
                                                                             &( cInputCommandString[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
#else
            configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                                                             xSourceAddress.sin_port,
                                                                             &( cInputCommandString[ PACKET_HEADER_LENGTH ] ) ) );
#endif
            do
            {
                /* Send the received command to the FreeRTOS+CLI. */
                xResponseRemaining = FreeRTOS_CLIProcessCommand( &( cInputCommandString[ PACKET_HEADER_LENGTH ] ),
                                                                    pcOutputBuffer,
                                                                    configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 );

                /* Ensure null termination so that the strlen below does not
                * end up reading past bounds. */
                pcOutputBuffer[ configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 ] = '\0';

                ulResponseLength = strlen( pcOutputBuffer );

                /* HACK - Check if the output buffer contains one of our special
                * markers indicating the need of a special response and process
                * accordingly. */
                if( strncmp( pcOutputBuffer, "PCAP-GET", ulResponseLength ) == 0 )
                {
                    const uint8_t * pucPcapData;
                    uint32_t ulPcapDataLength;

                    pcap_capture_get_captured_data( &( pucPcapData ),
                                                    &( ulPcapDataLength) );

                    xResponseSent = prvSendCommandResponse( xCLIServerSocket,
                                                            &( xSourceAddress ),
                                                            xSourceAddressLength,
                                                            &( ucPacketNumber ),
                                                            &( ucRequestId [ 0 ] ),
                                                            pucPcapData,
                                                            ulPcapDataLength );

                    /* Next fetch should not get the same capture but the capture
                    * after this point. */
                    pcap_capture_reset();
                }
                else
                {
                    /* Send the command response. */
                    xResponseSent = prvSendCommandResponse( xCLIServerSocket,
                                                            &( xSourceAddress ),
                                                            xSourceAddressLength,
                                                            &( ucPacketNumber ),
                                                            &( ucRequestId [ 0 ] ),
                                                            ( const uint8_t * ) pcOutputBuffer,
                                                            ulResponseLength );
                }

                if( xResponseSent == pdPASS )
                {
                    configPRINTF( ( "Response sent successfully. \n" ) );
                }
                else
                {
                    configPRINTF( ( "[ERROR] Failed to send response. \n" ) );
                }
            } while( xResponseRemaining == pdTRUE );

            /* Send the last packet with zero payload length. */
            ( void ) prvSendResponseEndMarker( xCLIServerSocket,
                                               &( xSourceAddress ),
                                               xSourceAddressLength,
                                               &( ucPacketNumber ),
                                               &( ucRequestId [ 0 ] ) );
        }
        else
        {
            configPRINTF( ( "[ERROR] Malformed request. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                                                                      xSourceAddress.sin_port,
                                                                                      cInputCommandString ) );
        }
    }
}
/*-----------------------------------------------------------*/

static void prvRegisterCLICommands( void )
{
extern void vRegisterPingCommand( void );
extern void vRegisterPcapCommand( void );
extern void vRegisterNetStatCommand( void );
extern void vRegisterTopCommand( void );

    vRegisterPingCommand();
    vRegisterPcapCommand();
    vRegisterNetStatCommand();
    vRegisterTopCommand();
}
/*-----------------------------------------------------------*/

static void prvConfigureMPU( void )
{
    MPU_Region_InitTypeDef MPU_InitStruct;

    HAL_MPU_Disable();

    /*  Configure the MPU attributes of RAM_D2 ( which contains .ethernet_data )
     * as Write back, Read allocate, Write allocate. */
    MPU_InitStruct.Enable           = MPU_REGION_ENABLE;
    MPU_InitStruct.BaseAddress      = 0x30000000;
    MPU_InitStruct.Size             = MPU_REGION_SIZE_256KB;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
    MPU_InitStruct.IsCacheable      = MPU_ACCESS_NOT_CACHEABLE;
    MPU_InitStruct.IsShareable      = MPU_ACCESS_SHAREABLE;
    MPU_InitStruct.Number           = MPU_REGION_NUMBER0;
    MPU_InitStruct.TypeExtField     = MPU_TEX_LEVEL1;
    MPU_InitStruct.SubRegionDisable = 0x00;
    MPU_InitStruct.DisableExec      = MPU_INSTRUCTION_ACCESS_ENABLE;

    HAL_MPU_ConfigRegion( &( MPU_InitStruct ) );

    HAL_MPU_Enable( MPU_PRIVILEGED_DEFAULT );
}
/*-----------------------------------------------------------*/

static BaseType_t prvIsValidRequest( const uint8_t * pucPacket, uint32_t ulPacketLength, uint8_t * pucRequestId )
{
    BaseType_t xValidRequest = pdFALSE;
    PacketHeader_t * header;
    uint16_t usPayloadLength;

