tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
    if( ulPacketLength > PACKET_HEADER_LENGTH )
    {
        header = ( PacketHeader_t * )pucPacket;
        usPayloadLength = FreeRTOS_ntohs( header->usPayloadLength );

        if( ( header->ucStartMarker == PACKET_START_MARKER ) &&
            ( header->ucPacketNumber == 1 ) &&
            ( ( usPayloadLength + PACKET_HEADER_LENGTH ) == ulPacketLength ) )
        {
            xValidRequest = pdTRUE;
            memcpy( pucRequestId, &( header->ucRequestId[ 0 ] ), 4 );
        }
    }

    return xValidRequest;
}
/*-----------------------------------------------------------*/

static BaseType_t prvSendResponseEndMarker( Socket_t xCLIServerSocket,
                                            struct freertos_sockaddr * pxSourceAddress,
                                            socklen_t xSourceAddressLength,
                                            uint8_t *pucPacketNumber,
                                            uint8_t *pucRequestId )
{
    BaseType_t ret;
    PacketHeader_t header;
    int32_t lBytesSent;

    header.ucStartMarker = PACKET_START_MARKER;
    header.ucPacketNumber = *pucPacketNumber;
    header.usPayloadLength = 0U;
    memcpy( &( header.ucRequestId[ 0 ] ), pucRequestId, 4 );

#if USE_ZERO_COPY
        /*
        * First obtain a buffer of adequate length from the TCP/IP stack into which
        the string will be written. */
#if USE_OLD_GET_UDP_BUFFER_API
        uint8_t *pucBuffer = FreeRTOS_GetUDPPayloadBuffer( sizeof( PacketHeader_t ), portMAX_DELAY );
#else
        uint8_t *pucBuffer = FreeRTOS_GetUDPPayloadBuffer_IPv46( sizeof( PacketHeader_t ), portMAX_DELAY, ipTYPE_IPv4 );
#endif /* USE_OLD_GET_UDP_BUFFER_API */
        configASSERT( pucBuffer != NULL );
        memcpy( pucBuffer , &header, sizeof( PacketHeader_t ) );

        lBytesSent = FreeRTOS_sendto( xCLIServerSocket,
                                    ( void * ) ( pucBuffer ),
                                    sizeof( PacketHeader_t ),
                                    FREERTOS_ZERO_COPY,
                                    pxSourceAddress,
                                    xSourceAddressLength );
#else

        lBytesSent = FreeRTOS_sendto( xCLIServerSocket,
                                    ( void * ) ( &header ),
                                    sizeof( PacketHeader_t ),
                                    0,
                                    pxSourceAddress,
                                    xSourceAddressLength );

#endif /* USE_ZERO_COPY */

    if( lBytesSent != PACKET_HEADER_LENGTH )
    {
        configPRINTF( ("[ERROR] Failed to last response header.\n" ) );
        ret = pdFAIL;
    }

    return ret;
}
/*-----------------------------------------------------------*/

static BaseType_t prvSendCommandResponse( Socket_t xCLIServerSocket,
                                          struct freertos_sockaddr * pxSourceAddress,
                                          socklen_t xSourceAddressLength,
                                          uint8_t *pucPacketNumber,
                                          uint8_t *pucRequestId,
                                          const uint8_t * pucResponse,
                                          uint32_t ulResponseLength )
{
    BaseType_t ret = pdPASS;
    PacketHeader_t header;
    int32_t lBytesSent;
    uint32_t ulBytesToSend, ulRemainingBytes, ulBytesSent;

    ulRemainingBytes = ulResponseLength;
    ulBytesSent = 0;

    while( ulRemainingBytes > 0 )
    {
        ulBytesToSend = ulRemainingBytes;

        if( ulBytesToSend > mainMAX_UDP_RESPONSE_SIZE )
        {
            ulBytesToSend = mainMAX_UDP_RESPONSE_SIZE;
        }

        /* Write header to the response buffer. */
        header.ucStartMarker = PACKET_START_MARKER;
        header.ucPacketNumber = *pucPacketNumber;
        *pucPacketNumber = ( *pucPacketNumber ) + 1;
        header.usPayloadLength = FreeRTOS_htons( ( uint16_t ) ulBytesToSend );
        memcpy( &( header.ucRequestId[ 0 ] ), pucRequestId, 4 );

        memcpy( &( ucUdpResponseBuffer[ 0 ] ),
                &( header ),
                PACKET_HEADER_LENGTH );

        /* Write actual response to the buffer. */
        memcpy( &( ucUdpResponseBuffer[ PACKET_HEADER_LENGTH] ),
                &( pucResponse[ ulBytesSent ] ),
                ulBytesToSend );



#if USE_ZERO_COPY
            /*
            * First obtain a buffer of adequate length from the TCP/IP stack into which
            the string will be written. */
#if USE_OLD_GET_UDP_BUFFER_API
        	uint8_t *pucBuffer = FreeRTOS_GetUDPPayloadBuffer( ulBytesToSend + PACKET_HEADER_LENGTH, portMAX_DELAY );
#else
        	uint8_t *pucBuffer = FreeRTOS_GetUDPPayloadBuffer_IPv46( ulBytesToSend + PACKET_HEADER_LENGTH, portMAX_DELAY, ipTYPE_IPv4 );
#endif /* USE_OLD_GET_UDP_BUFFER_API */
            configASSERT( pucBuffer != NULL );
            memcpy( pucBuffer , &( ucUdpResponseBuffer[ 0 ] ), ulBytesToSend + PACKET_HEADER_LENGTH );

            /* Send response. */
            lBytesSent = FreeRTOS_sendto( xCLIServerSocket,
                                        ( void * ) pucBuffer,
                                        ulBytesToSend + PACKET_HEADER_LENGTH,
                                        FREERTOS_ZERO_COPY,
                                        pxSourceAddress,
                                        xSourceAddressLength );
#else

            /* Send response. */
            lBytesSent = FreeRTOS_sendto( xCLIServerSocket,
                                        ( void * ) &( ucUdpResponseBuffer[ 0 ] ),
                                        ulBytesToSend + PACKET_HEADER_LENGTH,
                                        0,
                                        pxSourceAddress,
                                        xSourceAddressLength );

#endif /* USE_ZERO_COPY */

        if( lBytesSent != ( ulBytesToSend + PACKET_HEADER_LENGTH ) )
        {
            configPRINTF( ("[ERROR] Failed to send response.\n" ) );
            ret = pdFAIL;
            break;
        }

        ulRemainingBytes -= ulBytesToSend;
        ulBytesSent += ulBytesToSend;
    }

    return ret;
}
/*-----------------------------------------------------------*/

uint32_t ulApplicationGetNextSequenceNumber( uint32_t ulSourceAddress,
                                             uint16_t usSourcePort,
                                             uint32_t ulDestinationAddress,
                                             uint16_t usDestinationPort )
{
    uint32_t ulReturn;

    ( void ) ulSourceAddress;
    ( void ) usSourcePort;
    ( void ) ulDestinationAddress;
    ( void ) usDestinationPort;

    xApplicationGetRandomNumber( &ulReturn );

